backend: tensorflow
class_name: Model
config:
  input_layers:
  - [input_1, 0, 0]
  layers:
  - class_name: InputLayer
    config:
      batch_input_shape: !!python/tuple [null, 150, 150, 3]
      dtype: float32
      name: input_1
      sparse: false
    inbound_nodes: []
    name: input_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: &id001 !!python/tuple [1, 1]
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: !!python/tuple [7, 7]
      name: conv2d_1
      padding: same
      strides: !!python/tuple [2, 2]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - input_1
        - 0
        - 0
        - {}
    name: conv2d_1
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_1
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - conv2d_1
        - 0
        - 0
        - {}
    name: max_pooling2d_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: !!python/tuple [1, 1]
      name: conv2d_2
      padding: same
      strides: &id002 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_1
        - 0
        - 0
        - {}
    name: conv2d_2
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: !!python/tuple [3, 3]
      name: conv2d_3
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_2
        - 0
        - 0
        - {}
    name: conv2d_3
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_2
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - conv2d_3
        - 0
        - 0
        - {}
    name: max_pooling2d_2
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: &id004 !!python/tuple [1, 1]
      name: conv2d_5
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_5
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: &id005 !!python/tuple [1, 1]
      name: conv2d_7
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_7
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_3
      padding: same
      pool_size: &id006 !!python/tuple [3, 3]
      strides: &id007 !!python/tuple [1, 1]
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: max_pooling2d_3
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: &id008 !!python/tuple [1, 1]
      name: conv2d_4
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_2
        - 0
        - 0
        - {}
    name: conv2d_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: &id009 !!python/tuple [3, 3]
      name: conv2d_6
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_5
        - 0
        - 0
        - {}
    name: conv2d_6
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: &id010 !!python/tuple [5, 5]
      name: conv2d_8
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_7
        - 0
        - 0
        - {}
    name: conv2d_8
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: &id011 !!python/tuple [1, 1]
      name: conv2d_9
      padding: same
      strides: &id012 !!python/tuple [1, 1]
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_3
        - 0
        - 0
        - {}
    name: conv2d_9
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_1, trainable: true}
    inbound_nodes:
    - - - conv2d_4
        - 0
        - 0
        - &id003 {}
      - - conv2d_6
        - 0
        - 0
        - *id003
      - - conv2d_8
        - 0
        - 0
        - *id003
      - - conv2d_9
        - 0
        - 0
        - *id003
    name: concatenate_1
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id004
      name: conv2d_11
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: conv2d_11
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id005
      name: conv2d_13
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: conv2d_13
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_4
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: max_pooling2d_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id008
      name: conv2d_10
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_1
        - 0
        - 0
        - {}
    name: conv2d_10
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id009
      name: conv2d_12
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_11
        - 0
        - 0
        - {}
    name: conv2d_12
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id010
      name: conv2d_14
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_13
        - 0
        - 0
        - {}
    name: conv2d_14
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id011
      name: conv2d_15
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_4
        - 0
        - 0
        - {}
    name: conv2d_15
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_2, trainable: true}
    inbound_nodes:
    - - - conv2d_10
        - 0
        - 0
        - &id013 {}
      - - conv2d_12
        - 0
        - 0
        - *id013
      - - conv2d_14
        - 0
        - 0
        - *id013
      - - conv2d_15
        - 0
        - 0
        - *id013
    name: concatenate_2
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_5
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - concatenate_2
        - 0
        - 0
        - {}
    name: max_pooling2d_5
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 96
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id004
      name: conv2d_17
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: conv2d_17
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 16
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id005
      name: conv2d_19
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: conv2d_19
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_6
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: max_pooling2d_6
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id008
      name: conv2d_16
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_5
        - 0
        - 0
        - {}
    name: conv2d_16
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 208
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id009
      name: conv2d_18
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_17
        - 0
        - 0
        - {}
    name: conv2d_18
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id010
      name: conv2d_20
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_19
        - 0
        - 0
        - {}
    name: conv2d_20
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id011
      name: conv2d_21
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_6
        - 0
        - 0
        - {}
    name: conv2d_21
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_3, trainable: true}
    inbound_nodes:
    - - - conv2d_16
        - 0
        - 0
        - &id014 {}
      - - conv2d_18
        - 0
        - 0
        - *id014
      - - conv2d_20
        - 0
        - 0
        - *id014
      - - conv2d_21
        - 0
        - 0
        - *id014
    name: concatenate_3
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 112
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id004
      name: conv2d_23
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: conv2d_23
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 24
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id005
      name: conv2d_25
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: conv2d_25
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_7
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: max_pooling2d_7
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id008
      name: conv2d_22
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_3
        - 0
        - 0
        - {}
    name: conv2d_22
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 224
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id009
      name: conv2d_24
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_23
        - 0
        - 0
        - {}
    name: conv2d_24
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id010
      name: conv2d_26
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_25
        - 0
        - 0
        - {}
    name: conv2d_26
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id011
      name: conv2d_27
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_7
        - 0
        - 0
        - {}
    name: conv2d_27
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_4, trainable: true}
    inbound_nodes:
    - - - conv2d_22
        - 0
        - 0
        - &id015 {}
      - - conv2d_24
        - 0
        - 0
        - *id015
      - - conv2d_26
        - 0
        - 0
        - *id015
      - - conv2d_27
        - 0
        - 0
        - *id015
    name: concatenate_4
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id004
      name: conv2d_29
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: conv2d_29
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 24
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id005
      name: conv2d_31
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: conv2d_31
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_8
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: max_pooling2d_8
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id008
      name: conv2d_28
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_4
        - 0
        - 0
        - {}
    name: conv2d_28
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id009
      name: conv2d_30
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_29
        - 0
        - 0
        - {}
    name: conv2d_30
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id010
      name: conv2d_32
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_31
        - 0
        - 0
        - {}
    name: conv2d_32
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id011
      name: conv2d_33
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_8
        - 0
        - 0
        - {}
    name: conv2d_33
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_5, trainable: true}
    inbound_nodes:
    - - - conv2d_28
        - 0
        - 0
        - &id016 {}
      - - conv2d_30
        - 0
        - 0
        - *id016
      - - conv2d_32
        - 0
        - 0
        - *id016
      - - conv2d_33
        - 0
        - 0
        - *id016
    name: concatenate_5
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 144
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id004
      name: conv2d_35
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_5
        - 0
        - 0
        - {}
    name: conv2d_35
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id005
      name: conv2d_37
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_5
        - 0
        - 0
        - {}
    name: conv2d_37
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_9
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - concatenate_5
        - 0
        - 0
        - {}
    name: max_pooling2d_9
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 112
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id008
      name: conv2d_34
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_5
        - 0
        - 0
        - {}
    name: conv2d_34
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 288
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id009
      name: conv2d_36
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_35
        - 0
        - 0
        - {}
    name: conv2d_36
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id010
      name: conv2d_38
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_37
        - 0
        - 0
        - {}
    name: conv2d_38
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 64
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id011
      name: conv2d_39
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_9
        - 0
        - 0
        - {}
    name: conv2d_39
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_6, trainable: true}
    inbound_nodes:
    - - - conv2d_34
        - 0
        - 0
        - &id017 {}
      - - conv2d_36
        - 0
        - 0
        - *id017
      - - conv2d_38
        - 0
        - 0
        - *id017
      - - conv2d_39
        - 0
        - 0
        - *id017
    name: concatenate_6
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id004
      name: conv2d_41
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_6
        - 0
        - 0
        - {}
    name: conv2d_41
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id005
      name: conv2d_43
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_6
        - 0
        - 0
        - {}
    name: conv2d_43
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_10
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - concatenate_6
        - 0
        - 0
        - {}
    name: max_pooling2d_10
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id008
      name: conv2d_40
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_6
        - 0
        - 0
        - {}
    name: conv2d_40
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id009
      name: conv2d_42
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_41
        - 0
        - 0
        - {}
    name: conv2d_42
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id010
      name: conv2d_44
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_43
        - 0
        - 0
        - {}
    name: conv2d_44
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id011
      name: conv2d_45
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_10
        - 0
        - 0
        - {}
    name: conv2d_45
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_7, trainable: true}
    inbound_nodes:
    - - - conv2d_40
        - 0
        - 0
        - &id018 {}
      - - conv2d_42
        - 0
        - 0
        - *id018
      - - conv2d_44
        - 0
        - 0
        - *id018
      - - conv2d_45
        - 0
        - 0
        - *id018
    name: concatenate_7
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_11
      padding: same
      pool_size: !!python/tuple [3, 3]
      strides: !!python/tuple [2, 2]
      trainable: true
    inbound_nodes:
    - - - concatenate_7
        - 0
        - 0
        - {}
    name: max_pooling2d_11
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 160
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id004
      name: conv2d_47
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_47
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 32
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id005
      name: conv2d_49
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_49
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_12
      padding: same
      pool_size: *id006
      strides: *id007
      trainable: true
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: max_pooling2d_12
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 256
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id008
      name: conv2d_46
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_11
        - 0
        - 0
        - {}
    name: conv2d_46
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 320
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id009
      name: conv2d_48
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_47
        - 0
        - 0
        - {}
    name: conv2d_48
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id010
      name: conv2d_50
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - conv2d_49
        - 0
        - 0
        - {}
    name: conv2d_50
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 128
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id011
      name: conv2d_51
      padding: same
      strides: *id012
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - max_pooling2d_12
        - 0
        - 0
        - {}
    name: conv2d_51
  - class_name: Concatenate
    config: {axis: 3, name: concatenate_8, trainable: true}
    inbound_nodes:
    - - - conv2d_46
        - 0
        - 0
        - &id019 {}
      - - conv2d_48
        - 0
        - 0
        - *id019
      - - conv2d_50
        - 0
        - 0
        - *id019
      - - conv2d_51
        - 0
        - 0
        - *id019
    name: concatenate_8
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 192
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id004
      name: conv2d_53
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_8
        - 0
        - 0
        - {}
    name: conv2d_53
  - class_name: Conv2D
    config:
      activation: relu
      activity_regularizer: null
      bias_constraint: null
      bias_initializer:
        class_name: Zeros
        config: {}
      bias_regularizer: null
      data_format: channels_last
      dilation_rate: *id001
      filters: 48
      kernel_constraint: null
      kernel_initializer:
        class_name: VarianceScaling
        config: {distribution: uniform, mode: fan_avg, scale: 1.0, seed: null}
      kernel_regularizer:
        class_name: L1L2
        config: {l1: 0.0, l2: 0.009999999776482582}
      kernel_size: *id005
      name: conv2d_55
      padding: same
      strides: *id002
      trainable: true
      use_bias: true
    inbound_nodes:
    - - - concatenate_8
        - 0
        - 0
        - {}
    name: conv2d_55
  - class_name: MaxPooling2D
    config:
      data_format: channels_last
      name: max_pooling2d_13
      padding: same
      pool_size: *id006
      strides: *id007
